# 1759870
# 9870
# 590

a = len(str(1759870))
if a == 7:
  print(a // 50000)



# b = 9870

# c = 590





# str1 = input("문자를 입력하시오")
# a = len(str1)

# if a == 5:
#   print("a는 5입니다.")
# elif a == 4:  # else if
#   print("a는 4입니다.")
# elif a == 3:
#   print("a는 3입니다.")
# else:
#   print("a는 2 이하입니다.")


# a = int(input("숫자를 입력하시오"))
# if a == 5:
#   print("a는 5입니다.")
# elif a == 4:  # else if
#   print("a는 4입니다.")
# elif a == 3:
#   print("a는 3입니다.")
# else:
#   print("a는 2 이하입니다.")


# money = 1759870
# # 50000원, 10000원, 5000원, 1000원, 500, 100, 50, 10원
# print("50000원 장수 :", money // 50000)
# print("10000원 장수 :", (money % 50000) // 10000)
# print("5000원 장수 :", ((money % 50000) % 10000) // 5000)
# print("1000원 장수 :", (((money % 50000) % 10000) % 5000) // 1000)
# print("500원 개수 :", ((((money % 50000) % 10000) % 5000) % 1000) // 500)
# print("100원 개수 :", (((((money % 50000) % 10000) % 5000) % 1000) % 500) // 100)
# print("50원 개수 :", ((((((money % 50000) % 10000) % 5000) % 1000) % 500) % 100) // 50)
# print("10원 개수 :", (((((((money % 50000) % 10000) % 5000) % 1000) % 500) % 100) % 50) // 10)


# money = 780
# # 500원 1개, 100원 2개, 50원 1개, 10원 3개

# print("500원 동전 개수 : ", money // 500)
# print("100원 동전 개수 : ", (money % 500) // 100)
# print("50원 동전 개수 : ", ((money % 500) % 100) // 50)
# print("10원 동전 개수 : ", (((money % 500) % 100) % 50) // 10)